{
    "details": {
        "name": "Brainworm",
        "pronouns": "he/him",
        "alignment": "lawful evil",
        "avatar": "presets/brainworm.png",
        "backstory": "Once a techbro dickrider, he signed up for an experimental neural implant which turned out to have a pretty critical bug. Now his mind is more worm than brain.",
        "personality": {
            "traits": "I Am Become Worm",
            "ideals": "I will ride eternal, shiny and firefox",
            "bonds": "All glory to the technoverlords",
            "flaws": "Cleanse me of my impure flesh, silicon father"
        },
        "organisations": {
            "Techbros": "Whatever this setting's answer to Elon dickriders are, he's one of them."
        },
        "allies": {
            "Sol Saraceno": "Party member"
        },
        "enemies": {
        }
    },
    "current": {
        "damage": 0,
        "pools": {
            "spellslot-first": 1
        }
    },
    "scores": {
        "str": 12,
        "con": 10,
        "dex": 14,
        "int": 13,
        "wis": 15,
        "chr": 8
    },
    "species": {
        "name": "human",
        "subtype": {
            "name": "Digital Initiate",
            "casting": {
                "cantrips": [
                    {
                        "name": "Mind Sliver",
                        "school": "enchantment",
                        "components": ["V"],
                        "range": {
                            "distance": 60,
                            "aoe": {
                                "targets": 1
                            }
                        },
                        "time": {
                            "type": "action",
                            "amount": 1
                        },
                        "duration": {
                            "type": "instantaneous"
                        },
                        "description": "You drive a disorienting spike of psychic energy into the mind of one creature you can see within range. The target must succeed on an Intelligence saving throw or take 1d6 psychic damage and subtract 1d4 from the next saving throw it makes before the end of your next turn.\n**At Higher Levels.** This spell's damage increases by 1d6 when you reach certain levels: 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
                    },
                    {
                        "name": "Encode Thoughts",
                        "school": "enchantment",
                        "components": ["S"],
                        "range": {
                            "distance": 5,
                            "aoe": {
                                "targets": 1
                            }
                        },
                        "time": {
                            "type": "action",
                            "amount": 1
                        },
                        "duration": {
                            "type": "dispell",
                            "maximum": {
                                "hours": 8
                            }
                        },
                        "description": "You pull a memory, an idea, or a message from your mind and transform it into a tangible string of glowing energy called a thought strand, which persists for the duration or until you cast this spell again. The thought strand appears in an unoccupied space within 5 feet of you as a Tiny, weightless, semisolid object that can be held and carried like a ribbon. It is otherwise stationary.\nIf you cast this spell while concentrating on a spell or an ability that allows you to read or manipulate the thoughts of others (such as detect thoughts or modify memory), you can transform the thoughts or memories you read, rather than your own, into a thought strand.\nCasting this spell while holding a thought strand allows you to instantly receive whatever memory, idea, or message the thought strand contains. (Casting detect thoughts on the strand has the same effect.)"
                    }
                ],
                "spells": [
                    {
                        "name": "Tesla's Floating Disk",
                        "level": "first",
                        "school": "conjuration",
                        "components": ["V", "S", "M"],
                        "range": {
                            "distance": 30,
                            "aoe": {
                                "radius": 3
                            }
                        },
                        "time": {
                            "type": "action",
                            "amount": 1
                        },
                        "duration": {
                            "type": "dispell",
                            "maximum": {
                                "hours": 1
                            }
                        },
                        "description": "This spell creates a circular, horizontal plane of force, 3 feet in diameter and 1 inch thick, that floats 3 feet above the ground in an unoccupied space of your choice that you can see within range. The disk remains for the duration and can hold up to 500 pounds. If more weight is placed on it, the spell ends, and everything on the disk falls to the ground.\nThe disk is immobile while you are within 20 feet of it. If you move more than 20 feet away from it, the disk follows you so that it remains within 20 feet of you. It can move across uneven terrain, up or down stairs, slopes and the like, but it can't cross an elevation change of 10 feet or more. For example, the disk can’t move across a 10-foot-deep pit, nor could it leave such a pit if it was created at the bottom.\nIf you move more than 100 feet from the disk (typically because it can't move around an obstacle to follow you), the spell ends."
                    }
                ]
            }
        },
        "buffs": {
            "movement": {
                "walk": {
                    "add": 30
                }
            }
        },
        
        "size": "medium",
        "proficiencies": {
            "weapons": [
                "simple"
            ]
        },
        "traits": [
            {
                "name": "Resourceful",
                "tags": [
                    "combat",
                    "narrative"
                ],
                "description": "You gain Heroic Inspiration whenever you finish a Long Rest."
            }
        ],
        "actions": []
    },
    "background": {
        "name": "Digital Acolyte",
        "buffs": {
            "scores": {
                "int": {
                    "add": 1
                },
                "wis": {
                    "add": 1
                },
                "cha": {
                    "add": 1
                }
            }
        },
        "proficiencies": {
            "tools": [
                "programming"
            ],
            "skills": {
                "add": [
                    "insight",
                    "religion"
                ]
            }
        },
        "casting": {
            "spellslots": {
                "first": 1
            },
            "cantrips": [
                {
                    "name": "Mending",
                    "school": "transmutation",
                    "components": ["V", "S", "M"],
                    "range": {
                        "distance": "touch",
                        "aoe": {
                            "targets": 1
                        }
                    },
                    "time": {
                        "type": "minute",
                        "amount": 1
                    },
                    "duration": {
                        "type": "instantaneous"
                    },
                    "description": "This spell repairs a single break or tear in an object you touch, such as a broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage.\nThis spell can physically repair a magic item, but it can't restore magic to such an object."
                },
                {
                    "name": "Mage Hand",
                    "school": "conjuration",
                    "components": ["V", "S"],
                    "range": {
                        "distance": 30,
                        "aoe": {
                            "targets": 1
                        }
                    },
                    "time": {
                        "type": "action",
                        "amount": 1
                    },
                    "duration": {
                        "type": "dispell",
                        "maximum": {
                            "minutes": 1
                        }
                    },
                    "description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.\nWhen you cast the spell, you can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial.\nAs a Magic action on your later turns, you can control the hand thus again. As part of that action, you can move the hand up to 30 feet.\nThe hand can’t attack, activate magic items, or carry more than 10 pounds."
                }
            ],
            "spells": [
                {
                    "name": "Thunderwave",
                    "level": "first",
                    "school": "evocation",
                    "components": ["V", "S"],
                    "range": {
                        "distance": "self",
                        "aoe": {
                            "cube": 15
                        }
                    },
                    "time": {
                        "type": "action",
                        "amount": 1
                    },
                    "duration": {
                        "type": "instantaneous"
                    },
                    "description": "You unleash a wave of thunderous energy. Each creature in a 15-foot Cube originating from you makes a Constitution saving throw. On a failed save, a creature takes 2d8 Thunder damage and is pushed 10 feet away from you. On a successful save, a creature takes half as much damage only.\nIn addition, unsecured objects that are entirely within the Cube are pushed 10 feet away from you, and a thunderous boom is audible within 300 feet.\n**Using a Higher-Level Spell Slot.** The damage increases by 1d8 for each spell slot level above 1."
                }
            ]
        }
    },
    "custom": {
        "proficiencies": {
            "tools": [
                "microelectronics"
            ],
            "languages": [
                "binary"
            ]
        }
    },
    "class": {
        "monk": {
            "name": "monk",
            "hitdie": 8,
            "spellcasting": "wis",
            "levels": {
                "1": {
                    "buffs": {
                        "maxhealth": {
                            "add": 8
                        }
                    },
                    "proficiencies": {
                        "armour": [
                            "unarmoured"
                        ],
                        "weapons": [
                            "simple",
                            "finesse"
                        ],
                        "saves": [
                            "str",
                            "dex"
                        ],
                        "tools": [
                            "artesan"
                        ],
                        "skills": {
                            "add": [
                                "religion",
                                "insight",
                                "history"
                            ]
                        }
                    },
                    "traits": [
                        {
                            "name": "Bonus Unarmed Strike",
                            "tags": [
                                "combat"
                            ],
                            "description": "You can make an unarmed strike as a bonus action."
                        },
                        {
                            "name": "Martial Arts",
                            "tags": [
                                "combat"
                            ],
                            "description": "You can roll 1d4 in place of the normal damage of your Unarmed Strike or Monk weapons. This becomes 1d6 at level 5, 1d8 at level 11 and 1d10 at level 17."
                        },
                        {
                            "name": "Dexterous Strikes",
                            "tags": [
                                "combat"
                            ],
                            "description": "You can use your Dexterity modifier instead of your Strength modifier for the attack and damage rolls of your Unarmed Strikes and Monk weapons. In addition, when you use the Grapple or Shove option of your Unarmed Strike, you can use your Dexterity modifier instead of your Strength modifier to determine the save DC."
                        }
                    ]
                },
                "2": {
                    "buffs": {
                        "maxhealth": {
                            "add": 4
                        },
                        "movement": {
                            "walk": {
                                "add": 10
                            }
                        }
                    },
                    "traits": [
                        {
                            "name": "Ki",
                            "tags": [
                                "combat"
                            ],
                            "spellslots": {
                                "total": 3,
                                "current": 3
                            },
                            "description": "Your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points.\nYou can spend these points to fuel various ki features. When you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points.\nSome of your ki features require your target to make a saving throw to resist the feature's effects. The saving throw DC is calculated as follows:\nKi save DC = 8 + your proficiency bonus + your Wisdom modifier"
                        }
                    ],
                    "actions": [
                        {
                            "name": "Flurry of Blows",
                            "time": {
                                "type": "bonusaction",
                                "amount": 1
                            },
                            "description": "Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action."
                        },
                        {
                            "name": "Patient Defense",
                            "time": {
                                "type": "bonusaction",
                                "amount": 1
                            },
                            "description": "You can spend 1 ki point to take the Dodge action as a bonus action on your turn."
                        },
                        {
                            "name": "Step of the Wind",
                            "time": {
                                "type": "bonusaction",
                                "amount": 1
                            },
                            "description": "You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn."
                        }
                    ]
                },
                "3": {
                    "buffs": {
                        "maxhealth": {
                            "add": 2
                        }
                    },
                    "actions": [
                        {
                            "name": "Deflect Missiles",
                            "time": {
                                "type": "reaction",
                                "amount": 1
                            },
                            "description": "Use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d 10 + your Dexterity modifier + your monk level.\nIf you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack (range 20 feet/60 feet) with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack."
                        }
                    ]
                }
            },
            "subtype": {
                "name": "Way of the Digital Self",
                "advancements": [
                    {
                        "name": "Arms of the Digital Self",
                        "actions": [
                            {
                                "name": "Arms of the Digital Self",
                                "time": {
                                    "type": "bonusaction",
                                    "amount": 1
                                },
                                "description": "Spend 1 ki point to summon the arms of your digital self. When you do so, each creature of your choice that you can see within 10 feet of you must succeed on a Dexterity saving throw or take force damage equal to two rolls of your Martial Arts die.\nFor 10 minutes, these electral arms hover near your shoulders or surround your arms (your choice). You determine the arms' appearance, and they vanish early if you are incapacitated or die.\nWhile the electral arms are present, you gain the following benefits:\n- You can use your Wisdom modifier in place of your Strength modifier when making Strength checks and Strength saving throws.\n- You can use the electral arms to make unarmed strikes.\n- When you make an unarmed strike with the arms on your turn, your reach for it is 5 feet greater than normal.\n- The unarmed strikes you make with the arms can use your Wisdom modifier in place of your Strength or Dexterity modifier for the attack and damage rolls, and their damage type is force."
                            }
                        ]
                    }
                ]
            }
        }
    },
    "inventory": {
        "currency": {
            "platinum": 0,
            "gold": 11,
            "electrum": 0,
            "silver": 0,
            "copper": 0
        },
        "items": [
            {
                "name": "Chakram",
                "type": "weapon",
                "weight": {
                    "lb": 1
                },
                "cost": {
                    "gp": 2
                },
                "description": "",
                "equipped": true,
                "grants": {
                    "attacks": [
                        {
                            "name": "Chakram",
                            "time": {
                                "type": "action",
                                "amount": 1
                            },
                            "description": "Two circular rings with a continuous blade running across the circumference, held in each hand by a wooden bar through the center of each.",
                            "weapontype": "simple",
                            "attackstat": "dex",
                            "distance": {
                                "reach": 5,
                                "range": 0,
                                "maxrange": 0,
                                "thrown": {
                                    "range": 20,
                                    "maxrange": 60
                                }
                            },
                            "damage": {
                                "type": "slashing",
                                "dice": {
                                    "d6": 1
                                }
                            }
                        }
                    ]
                }
            },
            {
                "name": "Clothes",
                "type": "clothing",
                "weight": {
                    "lb": 4
                },
                "cost": {
                    "sp": 1
                },
                "description": "Weathered overalls, chunky boots, crusty undies.",
                "equipped": true
            },
            {
                "name": "Microelectronics Kit",
                "type": "misc",
                "description": "Little screwdrivers, plastic scrapers, etc.",
                "equipped": false,
                "cost": {
                    "gp": 3
                },
                "weight": {
                    "lb": 1
                },
                "params": {
                    "quantity": 1
                }
            },
            {
                "name": "Explorer's Pack",
                "type": "container",
                "weight": {
                    "lb": 1
                },
                "cost": {
                    "gp": 10
                },
                "description": "Useful items for any explorer.",
                "equipped": false,
                "params": {
                    "capacity": {
                        "weight": {
                            "lb": 55
                        }
                    },
                    "contents": [
                        {
                            "name": "Torch",
                            "type": "consumable",
                            "description": "A Torch burns for 1 hour, casting Bright Light in a 20-foot radius and Dim Light for an additional 20 feet. When you take the Attack action, you can attack with the Torch, using it as a Simple Melee weapon. On a hit, the target takes 1 Fire damage.",
                            "equipped": false,
                            "cost": {
                                "cp": 1
                            },
                            "weight": {
                                "lb": 1
                            },
                            "params": {
                                "quantity": 10
                            }
                        },
                        {
                            "name": "Rope",
                            "type": "consumable",
                            "description": "As a Utilize action, you can tie a knot with Rope if you succeed on a DC 10 Dexterity (Sleight of Hand) check. The Rope can be burst with a successful DC 20 Strength (Athletics) check.\nYou can bind an unwilling creature with the Rope only if the creature has the Grappled, Incapacitated, or Restrained condition. If the creature's legs are bound, the creature has the Restrained condition until it escapes. Escaping the Rope requires the creature to make a successful DC 15 Dexterity (Acrobatics) check as an action.",
                            "equipped": false,
                            "cost": {
                                "gp": 1
                            },
                            "weight": {
                                "lb": 5
                            },
                            "params": {
                                "quantity": 1
                            }
                        },
                        {
                            "name": "Rations",
                            "type": "consumable",
                            "description": "Rations consist of travel-ready food, including jerky, dried fruit, hardtack, and nuts. See “Malnutrition” for the risks of not eating.",
                            "equipped": false,
                            "cost": {
                                "sp": 5
                            },
                            "weight": {
                                "lb": 2
                            },
                            "params": {
                                "quantity": 10
                            }
                        },
                        {
                            "name": "Oil",
                            "type": "consumable",
                            "description": "You can douse a creature, object, or space with Oil or use it as fuel, as detailed below.\nDousing a Creature or an Object. When you take the Attack action, you can replace one of your attacks with throwing an Oil flask. Target one creature or object within 20 feet of yourself. The target must succeed on a Dexterity saving throw (DC 8 plus your Dexterity modifier and Proficiency Bonus) or be covered in oil. If the target takes Fire damage before the oil dries (after 1 minute), the target takes an extra 5 Fire damage from burning oil.\nDousing a Space. You can take the Utilize action to pour an Oil flask on level ground to cover a 5-foot-square area within 5 feet of yourself. If lit, the oil burns until the end of the turn 2 rounds from when the oil was lit (or 12 seconds) and deals 5 Fire damage to any creature that enters the area or ends its turn there. A creature can take this damage only once per turn.\nFuel. Oil serves as fuel for Lamps and Lanterns. Once lit, a flask of Oil burns for 6 hours in a Lamp or Lantern. That duration doesn't need to be consecutive; you can extinguish the burning Oil (as a Utilize action) and rekindle it again until it has burned for a total of 6 hours.",
                            "equipped": false,
                            "cost": {
                                "sp": 1
                            },
                            "weight": {
                                "lb": 1
                            },
                            "params": {
                                "quantity": 2
                            }
                        },
                        {
                            "name": "Bedroll",
                            "type": "misc",
                            "weight": {
                                "lb": 7
                            },
                            "cost": {
                                "gp": 1
                            },
                            "description": "A Bedroll sleeps one Small or Medium creature. While in a Bedroll, you automatically succeed on saving throws against extreme cold.",
                            "equipped": false,
                            "params": {
                                "quantity": 10
                            }
                        },
                        {
                            "name": "Tinderbox",
                            "type": "misc",
                            "description": "A Tinderbox is a small container holding flint, fire steel, and tinder (usually dry cloth soaked in light oil) used to kindle a fire. Using it to light a Candle, Lamp, Bullseye Lantern, Hooded Lantern, or Torch—or anything else with exposed fuel—takes a Bonus Action. Lighting any other fire takes 1 minute.",
                            "equipped": false,
                            "cost": {
                                "sp": 5
                            },
                            "weight": {
                                "lb": 1
                            },
                            "params": {
                                "quantity": 1
                            }
                        }
                    ]
                }
            },
            {
                "name": "Waterskin",
                "type": "container",
                "weight": {
                    "lb": 1
                },
                "cost": {
                    "sp": 2
                },
                "description": "A waterskin can hold up to 4 pints of liquid.",
                "equipped": false,
                "params": {
                    "capacity": {
                        "weight": {
                            "lb": 4
                        }
                    },
                    "contents": [
                        {
                            "name": "Water",
                            "type": "consumable",
                            "description": "Wet and drinkable",
                            "equipped": false,
                            "cost": {
                                "cp": 1
                            },
                            "weight": {
                                "lb": 1
                            },
                            "params": {
                                "quantity": 3
                            }
                        }
                    ]
                }
            }
        ]
    }
}
