{
    "details": {
        "name": "Cerys Freshdew",
        "pronouns": "she/her",
        "alignment": "lawful good",
        "avatar": "presets/cerys.png",
        "backstory": "After inheriting an old family heirloom, a magical staff with a crystal from the old dwarven mines, Cerys dedicated herself to using its magic to heal the damage caused by the old mines.",
        "personality": {
            "traits": "Manners are very important - I'll like you a lot better if you tuck in your shirt and keep your elbows off the table!",
            "ideals": "It is my duty to repair the environmental damage done by my people.",
            "bonds": "The destruction caused by the old mines is a source of shame to my family, I will face any challenge to redeem us.",
            "flaws": "I can be a bit stuffy and beaurocratic at times."
        },
        "organisations": {
            "Dwarven Depletion Bulwark": "Cerys is employed by the Dwarven Depletion Bulwark (DDB), whose purpose is to regulate ergonite mining to stave off planetary ergonite depletion."
        },
        "allies": {
            "Daemar": "Party member",
            "Rigby": "Party member",
            "Naari": "Party member",
            "Hank": "Party member / Daemar's lover"
        },
        "enemies": {
            "Verdegris": "Main villain",
            "Saer Stoneguard": "Father",
            "Gwenfrith Stoneguard": "Mother",
            "Gareth Earthfriend": "Ex"
        }
    },
    "current": {
        "damage": 28,
        "spellslots": {
            "first": 3,
            "second": 2,
            "third": 0,
            "fourth": 0
        }
    },
    "scores": {
        "str": 9,
        "con": 11,
        "dex": 14,
        "int": 15,
        "wis": 15,
        "chr": 16
    },
    "species": {
        "name": "dwarf",
        "subtype": {
            "name": "Hill",
            "buffs": {
                "scores": {
                    "wis": {
                        "add": 1
                    }
                },
                "maxhealth": {
                    "perlevel": 1
                }
            }
        },
        "size": "medium",
        "buffs": {
            "scores": {
                "con": {
                    "add": 2
                }
            },
            "movement": {
                "walk": {
                    "add": 25
                }
            }
        },
        "proficiencies": {
            "weapons": ["battleaxe", "handaxe", "lighthammer", "warhammer"],
            "tools": ["brewer"],
            "languages": ["common", "dwarvish"],
            "armour": []
        },
        "traits": [
            {
                "name": "Darkvision",
                "tags": ["combat", "narrative"],
                "description": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
            },
            {
                "name": "Dwarven Resilience",
                "tags": ["combat", "narrative"],
                "description": "You have advantage on saving throws against poison, and you have resistance against poison damage."
            },
            {
                "name": "Stonecunning",
                "tags": ["narrative"],
                "description": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
            },
            {
                "name": "Dwarven Toughness",
                "tags": ["buff"],
                "description": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level.",
                "effect": {
                    "maxhp": {
                        "flat": 1,
                        "perlevel": 1
                    }
                }
            }
        ],
        "actions": []
    },
    "background": {
        "name": "Noble",
        "proficiencies": {
            "skills": {
                "set": {
                    "history": 1,
                    "persuasion": 1
                }
            },
            "tools": [
                "dice"
            ],
            "languages": [
                "elemental"
            ]
        },
        "traits": {
            "name": "Position of Privilege",
            "tags": ["narrative"],
            "description": "Thanks to your noble birth, people are inclined to think the best of you. You are welcome in high society, and people assume you have the right to be wherever you are. The common folk make every effort to accommodate you and avoid your displeasure, and other people of high birth treat you as a member of the same social sphere. You can secure an audience with a local noble if you need to."
        }
    },
    "custom": {
    },
    "class": {
        "druid": {
            "name": "druid",
            "hitdie": 8,
            "spellcasting": "wis",
            "levels": {
                "1": {
                    "buffs": {
                        "maxhealth": {
                            "add": 8
                        }
                    },
                    "proficiencies": {
                        "armour": [
                            "light", 
                            "medium", 
                            "shields"
                        ],
                        "weapons": [
                            "simple"
                        ],
                        "saves": [
                            "int", 
                            "wis"
                        ],
                        "tools": [
                            "herbalism"
                        ],
                        "languages": [
                            "druidic"
                        ],
                        "skills": {
                            "set": {
                                "arcana": 1,
                                "history": 1,
                                "nature": 1
                            }
                        }
                    },
                    "traits": [
                        {
                            "name": "Ritual Casting",
                            "tags": ["combat", "narrative"],
                            "description": "You can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared."
                        }
                    ],
                    "actions": [],
                    "casting": {
                        "spellslots": {
                            "first": 2
                        },
                        "cantrips": [
                            {
                                "name": "Elementalism",
                                "level": "cantrip",
                                "range": {
                                    "distance": 30,
                                    "aoe": {
                                        "cube": 5
                                    }
                                },
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "instantaneous"
                                },
                                "components": [
                                    "V",
                                    "S"
                                ],
                                "school": "transmutation",
                                "description": "You exert control over the elements, creating one of the following effects within range.\n- **Beckon Air.** You create a breeze strong enough to ripple cloth, stir dust, rustle leaves, and close open doors and shutters, all in a 5-foot Cube. Doors and shutters being held open by someone or something aren't affected.\n- **Beckon Earth.** You create a thin shroud of dust or sand that covers surfaces in a 5-foot-square area, or you cause a single word to appear in your handwriting in a patch of dirt or sand.\n- **Beckon Fire.** You create a thin cloud of harmless embers and colored, scented smoke in a 5-foot Cube. You choose the color and scent, and the embers can light candles, torches, or lamps in that area. The smoke's scent lingers for 1 minute.\n- **Beckon Water.** You create a spray of cool mist that lightly dampens creatures and objects in a 5-foot Cube. Alternatively, you create 1 cup of clean water either in an open container or on a surface, and the water evaporates in 1 minute.\n- **Sculpt Element.** You cause dirt, sand, fire, smoke, mist, or water that can fit in a 1-foot Cube to assume a crude shape (such as that of a creature) for 1 hour."
                            },
                            {
                                "name": "Magic Stone",
                                "level": "cantrip",
                                "range": {
                                    "distance": 60,
                                    "aoe": {
                                        "targets": 3
                                    }
                                },
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "dispell",
                                    "maximum": {
                                        "minutes": 1
                                    }
                                },
                                "components": [
                                    "V",
                                    "S"
                                ],
                                "school": "transmutation",
                                "description": "You touch one to three pebbles and imbue them with magic. You or someone else can make a ranged spell attack with one of the pebbles by throwing it or hurling it with a sling. If thrown, it has a range of 60 feet. If someone else attacks with the pebble, that attacker adds your spellcasting ability modifier, not the attacker's, to the attack roll. On a hit, the target takes bludgeoning damage equal to 1d6 + your spellcasting ability modifier. Hit or miss, the spell then ends on the stone.\nIf you cast this spell again, the spell ends early on any pebbles still affected by it."
                            }
                        ],
                        "spells": [
                            {
                                "name": "Earth Tremor",
                                "level": "first",
                                "school": "evocation",
                                "components": [
                                    "V",
                                    "S"
                                ],
                                "range": {
                                    "distance": "self",
                                    "aoe": {
                                        "radius": 10
                                    }
                                },
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "instantaneous"
                                },
                                "description": "You cause a tremor in the ground within range. Each creature other than you in that area must make a Dexterity saving throw. On a failed save, a creature takes 1d6 bludgeoning damage and is knocked prone. If the ground in that area is loose earth or stone, it becomes difficult terrain until cleared, with each 5-foot-diameter portion requiring at least 1 minute to clear by hand.\n***At Higher Levels.*** When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."
                            },
                            {
                                "name": "Fog Cloud",
                                "level": "first",
                                "school": "conjuration",
                                "components": [
                                    "V",
                                    "S"
                                ],
                                "range": {
                                    "distance": 120,
                                    "aoe": {
                                        "radius": 20
                                    }
                                },
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "dispell",
                                    "maximum": {
                                        "hours": 1
                                    }
                                },
                                "description": "You create a 20-foot-radius Sphere of fog centered on a point within range. The Sphere is Heavily Obscured. It lasts for the duration or until a strong wind (such as one created by Gust of Wind) disperses it.\n***Using a Higher-Level Spell Slot.*** The fog's radius increases by 20 feet for each spell slot level above 1."
                            },
                            {
                                "name": "Goodberry",
                                "level": "first",
                                "school": "conjuration",
                                "components": ["V", "S", "M"],
                                "range": {
                                    "distance": "self",
                                    "aoe": {
                                        "targets": 1
                                    }
                                },
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "dispell",
                                    "maximum": {
                                        "hours": 24
                                    }
                                },
                                "description": "Ten berries appear in your hand and are infused with magic for the duration. A creature can take a Bonus Action to eat one berry. Eating a berry restores 1 Hit Point, and the berry provides enough nourishment to sustain a creature for one day.\nUneaten berries disappear when the spell ends."
                            },
                            {
                                "name": "Healing Word",
                                "level": "first",
                                "school": "abjuration",
                                "components": ["V"],
                                "range": {
                                    "distance": 60,
                                    "aoe": {
                                        "targets": 1
                                    }
                                },
                                "time": {
                                    "type": "bonusaction",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "instantaneous"
                                },
                                "description": "A creature of your choice that you can see within range regains Hit Points equal to 2d4 plus your spellcasting ability modifier.\nUsing a Higher-Level Spell Slot. The healing increases by 2d4 for each spell slot level above 1."
                            }
                        ]
                    }
                },
                "2": {
                    "buffs": {
                        "maxhealth": {
                            "add": 2
                        }
                    },
                    "actions": [
                        {
                            "name": "Wild Shape",
                            "time": {
                                "type": "action",
                                "amount": 1
                            },
                            "spellslots": {
                                "total": 2,
                                "current": 2
                            },
                            "description": "Starting at second level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\n\nYour druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At second level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.\n\nYou can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.\n\nWhile you are transformed, the following rules apply:\n- Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.\n- When you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form, For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.\n- You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as Call Lightning, that you've already cast.\n- You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense.\n- You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form."
                        }
                    ],
                    "casting": {
                        "spellslots": {
                            "first": 1
                        },
                        "spells": [
                            {
                                "name": "Spike Growth",
                                "level": "first",
                                "school": "transmutation",
                                "components": ["V", "S", "M"],
                                "range": {
                                    "distance": 150,
                                    "aoe": {
                                        "radius": 20
                                    }
                                },
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "concentration",
                                    "maximum": {
                                        "minutes": 10
                                    }
                                },
                                "description": "The ground in a 20-foot-radius Sphere centered on a point within range sprouts hard spikes and thorns. The area becomes Difficult Terrain for the duration. When a creature moves into or within the area, it takes 2d4 Piercing damage for every 5 feet it travels.\nThe transformation of the ground is camouflaged to look natural. Any creature that can't see the area when the spell is cast must take a Search action and succeed on a Wisdom (Perception or Survival) check against your spell save DC to recognize the terrain as hazardous before entering it."
                            }
                        ]
                    }
                },
                "3": {
                    "buffs": {
                        "maxhealth": {
                            "add": 1
                        }
                    },
                    "casting": {
                        "spellslots": {
                            "first": 1,
                            "second": 2
                        },
                        "spells": [
                            {
                                "name": "Summon Beast",
                                "level": "second",
                                "school": "",
                                "components": ["V", "S", "M"],
                                "range": {
                                    "distance": 90,
                                    "aoe": {
                                        "targets": 1
                                    }
                                },
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "concentration",
                                    "maximum": {
                                        "hours": 1
                                    }
                                },
                                "description": "You call forth a bestial spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Bestial Spirit stat block. When you cast the spell, choose an environment: Air, Land, or Water. The creature resembles an animal of your choice that is native to the chosen environment, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.\nThe creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the Dodge action and uses its move to avoid danger.\n***At Higher Levels.*** When you cast this spell using a spell slot of 3rd level or higher, use the higher level where the spell's level appears in the stat block.\n\n> ### Bestial Spirit\n> *Small beast*\n> **Armor Class** 11 + the level of the spell (natural armor)\n> **Hit Points** 20 (Air only) or 30 (Land and Water only) + 5 for each spell > level above 2nd\n> **Speed** 30 ft., climb 30 ft. (Land only), fly 60 ft. (Air only), swim 30 ft. (Water only)\n> **Senses** darkvision 60 ft., passive Perception 12\n> **Languages** understands the languages you speak\n> **Proficiency Bonus** equals your bonus\n> \n> | STR | DEX | CON | INT | WIS | CHA |\n> | --- | --- | --- | --- | --- | --- |\n> | 18 (+4) | 11 (+0) | 16 (+3) | 4 (-3) | 14 (+2) | 5 (-3) |\n> \n> ***Flyby (Air Only)*** The beast doesn't provoke opportunity attacks when it flies out of an enemy's reach.\n> ***Pack Tactics (Land and Water Only)*** The beast has advantage on an attack roll against a creature if at least one of the beast's allies is within 5 feet of the creature and the ally isn't incapacitated.\n> ***Water Breathing (Water Only).*** The beast can breathe only underwater.\n> \n> #### Actions\n> ***Multiattack.*** The beast makes a number of attacks equal to half this spell's level (rounded down).\n> ***Maul** Melee Weapon Attack:* your spell attack modifier to hit, reach 5 ft., one target. Hit: 1d8 + 4 + the spell's level piercing damage."
                            }
                        ]
                    }
                },
                "4": {
                    "buffs": {
                        "maxhealth": {
                            "add": 7
                        },
                        "scores": {
                            "wis": {
                                "add": 1
                            },
                            "con": {
                                "add": 1
                            }
                        }
                    },
                    "casting": {
                        "spellslots": {
                            "second": 1
                        },
                        "cantrips": [
                            {
                                "name": "Shillelagh",
                                "level": "cantrip",
                                "school": "transmutation",
                                "components": ["V", "S", "M"],
                                "range": {
                                    "distance": "touch",
                                    "aoe": {
                                        "targets": 1
                                    }
                                },
                                "time": {
                                    "type": "bonusaction",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "dispell",
                                    "maximum": {
                                        "minutes": 1
                                    }
                                },
                                "description": "A Club or Quarterstaff you are holding is imbued with nature's power. For the duration, you can use your spellcasting ability instead of Strength for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage die becomes a d8. If the attack deals damage, it can be Force damage or the weapon's normal damage type (your choice).\nThe spell ends early if you cast it again or if you let go of the weapon.\n**Cantrip Upgrade.** The damage die changes when you reach levels 5 (d10), 11 (d12), and 17 (2d6)."
                            }
                        ],
                        "spells": [
                            {
                                "name": "Gust of Wind",
                                "level": "second",
                                "school": "evocation",
                                "components": ["V", "S", "M"],
                                "range": {
                                    "distance": "self",
                                    "aoe": {
                                        "line": {
                                            "wide": 10,
                                            "long": 60
                                        }
                                    }
                                },
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "concentration",
                                    "maximum": {
                                        "minutes": 1
                                    }
                                },
                                "description": "A Line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the duration. Each creature in the Line must succeed on a Strength saving throw or be pushed 15 feet away from you in a direction following the Line. A creature that ends its turn in the Line must make the same save.\nAny creature in the Line must spend 2 feet of movement for every 1 foot it moves when moving closer to you.\nThe gust disperses gas or vapor, and it extinguishes candles and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them.\nAs a Bonus Action on your later turns, you can change the direction in which the Line blasts from you."
                            }
                        ]
                    }
                },
                "5": {
                    "buffs": {
                        "maxhealth": {
                            "add": 2
                        }
                    },
                    "casting": {
                        "spellslots": {
                            "third": 2
                        },
                        "spells": [
                            {
                                "name": "Aura of Vitality",
                                "level": "third",
                                "school": "evocation",
                                "components": ["V"],
                                "range": {
                                    "distance": "self",
                                    "aoe": {
                                        "radius": 30
                                    }
                                },
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "concentration",
                                    "maximum": {
                                        "minutes": 1
                                    }
                                },
                                "description": "Healing energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. You can use a bonus action to cause one creature in the aura (including you) to regain 2d6 hit points."
                            }
                        ]
                    }
                },
                "6": {
                    "buffs": {
                        "maxhealth": {
                            "add": 3
                        }
                    },
                    "casting": {
                        "spellslots": {
                            "third": 1
                        },
                        "spells": [
                            {
                                "name": "Sleet Storm",
                                "level": "third",
                                "school": "conjuration",
                                "components": ["V", "S", "M"],
                                "range": {
                                    "distance": 150,
                                    "aoe": {
                                        "cylinder": {
                                            "long": 40,
                                            "wide": 40
                                        }
                                    }
                                },
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "concentration",
                                    "maximum": {
                                        "minutes": 1
                                    }
                                },
                                "description": "Until the spell ends, sleet falls in a 40-foot-tall, 20-foot-radius Cylinder centered on a point you choose within range. The area is Heavily Obscured, and exposed flames in the area are doused.\nGround in the Cylinder is Difficult Terrain. When a creature enters the Cylinder for the first time on a turn or starts its turn there, it must succeed on a Dexterity saving throw or have the Prone condition and lose Concentration."
                            }
                        ]
                    }
                },
                "7": {
                    "buffs": {
                        "maxhealth": {
                            "add": 1
                        }
                    },
                    "casting": {
                        "spellslots": {
                            "fourth": 1
                        },
                        "spells": [
                            {
                                "name": "Conjure Woodland Beings",
                                "level": "fourth",
                                "school": "conjuration",
                                "components": ["V", "S"],
                                "range": {
                                    "distance": "self",
                                    "aoe": {
                                        "radius": 10
                                    }
                                },
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "duration": {
                                    "type": "concentration",
                                    "maximum": {
                                        "minutes": 10
                                    }
                                },
                                "description": "You conjure nature spirits that flit around you in a 10-foot Emanation for the duration. Whenever the Emanation enters the space of a creature you can see and whenever a creature you can see enters the Emanation or ends its turn there, you can force that creature to make a Wisdom saving throw. The creature takes 5d8 Force damage on a failed save or half as much damage on a successful one. A creature makes this save only once per turn.\nIn addition, you can take the Disengage action as a Bonus Action for the spell's duration.\nUsing a Higher-Level Spell Slot. The damage increases by 1d8 for each spell slot level above 4."
                            }
                        ]
                    }
                }
            },
            "subtype": {
                "name": "Circle of Petals",
                "advancements": [
                    {
                        "name": "Circle of Petals",
                        "actions": [
                            {
                                "name": "Circle of Petals: Guiding Bolt",
                                "time": {
                                    "type": "action",
                                    "amount": 1
                                },
                                "spellslots": {
                                    "current": 3,
                                    "total": 3
                                },
                                "description": "You can cast Guiding Bolt without expending a spell slot. You can do so a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
                            }
                        ],
                        "casting": {
                            "cantrips": [
                                {
                                    "name": "Guidance",
                                    "level": "cantrip",
                                    "school": "divination",
                                    "components": ["V", "S"],
                                    "range": {
                                        "distance": "touch",
                                        "aoe": {
                                            "targets": 1
                                        }
                                    },
                                    "time": {
                                        "type": "action",
                                        "amount": 1
                                    },
                                    "duration": {
                                        "type": "concentration",
                                        "maximum": {
                                            "minutes": 1
                                        }
                                    },
                                    "description": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends."
                                }
                            ],
                            "spells": [
                                {
                                    "name": "Guiding Bolt",
                                    "level": "first",
                                    "school": "evocation",
                                    "components": ["V", "S"],
                                    "range": {
                                        "distance": 120,
                                        "aoe": {
                                            "targets": 1
                                        }
                                    },
                                    "time": {
                                        "type": "action",
                                        "amount": 1
                                    },
                                    "duration": {
                                        "type": "instantaneous"
                                    },
                                    "description": "A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then.\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."
                                }
                            ]
                        }
                    },
                    {
                        "name": "Floral Form",
                        "actions": [
                            {
                                "name": "Floral Form",
                                "time": {
                                    "type": "bonusaction",
                                    "amount": 1
                                },
                                "description": "As a bonus action, you can expend a use of your Wild Shape feature to take on a floral form, rather than transforming into a beast.\nWhile in your floral form, you retain your game statistics, but your body bursts into luminous petals; your joints bloom as flowers, and glowing vines connect them. This form sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The form lasts for 10 minutes. It ends early if you dismiss it (no action required), are incapacitated, die, or use this feature again.\nWhenever you assume your floral form, choose what kind of flowers bloom on your body:\n- **Oxalis** You bloom with vibrant oxalis flowers. When you activate this form, and as a bonus action on your subsequent turns while it lasts, you can make a ranged spell attack, hurling a luminous seed pod that targets one creature within 60 feet of you. On a hit, the attack deals radiant damage equal to 1d8 + your Wisdom modifier. \n- **Magnolia** You bloom with delicate magnolia flowers. Whenever you cast a spell using a spell slot that restores hit points to a creature, you or another creature within 30 feet of you can regain hit points equal to 1d8 + your Wisdom modifier. \n- **Elderflower**: You bloom with fragrant elderflower. When you make an Intelligence or a Wisdom check or a Constitution saving throw to maintain concentration on a spell, you can treat a roll of 9 or lower on the d20 as a 10."
                            }
                        ]
                    },
                    {
                        "name": "Floral Omen",
                        "actions": [
                            {
                                "name": "Floral Omen",
                                "time": {
                                    "type": "reaction",
                                    "amount": 1
                                },
                                "spellslots": {
                                    "total": 3,
                                    "current": 3
                                },
                                "description": "Whenever you finish a long rest, you can toss petals in the air and consult them for omens. When you do so, roll a die. Until you finish your next long rest, you gain access to a special reaction based on whether you rolled an even or an odd number on the die:\n- **Weal (even).** Whenever a creature you can see within 30 feet of you is about to make an attack roll, a saving throw, or an ability check, you can use your reaction to roll a d6 and add the number rolled to the total.\n- **Woe (odd).** Whenever a creature you can see within 30 feet of you is about to make an attack roll, a saving throw, or an ability check, you can use your reaction to roll a d6 and subtract the number rolled from the total.\nYou can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
                            }
                        ]
                    }
                ]
            }
        }
    },
    "inventory": {
        "currency": {
            "platinum": 0,
            "gold": 311,
            "electrum": 0,
            "silver": 1,
            "copper": 6
        },
        "items": [
            {
                "name": "Elven chain shirt",
                "type": "armour",
                "weight": {
                    "lb": 20
                },
                "cost": {
                    "gp": 20
                },
                "description": "You gain a +1 bonus to AC while you wear this armor. You are considered proficient with this armor even if you lack proficiency with medium armor.",
                "equipped": true,
                "params": {
                    "type": "medium",
                    "bonus": 1
                }
            },
            {
                "name": "Leather armour",
                "type": "armour",
                "weight": {
                    "lb": 10
                },
                "cost": {
                    "gp": 10
                },
                "description": "The breastplate and shoulder protectors of this armor are made of leather that has been stiffened by being boiled in oil. The rest of the armor is made of softer and more flexible materials.",
                "equipped": true,
                "params": {
                    "type": "light",
                    "ac": 11
                }
            },
            {
                "name": "Fine Clothes",
                "type": "clothing",
                "weight": {
                    "lb": 6
                },
                "cost": {
                    "gp": 15
                },
                "description": "This set of clothes is designed specifically to be expensive and to show it, including fancy, tailored clothes in whatever fashion happens to be the current style in the courts of the nobles. Precious metals and gems could be worked into the clothing.",
                "equipped": true
            },
            {
                "name": "Boots of false tracks",
                "type": "clothing",
                "weight": null,
                "cost": null,
                "description": "Leaves tracks of any medium humanoid.",
                "equipped": true
            },
            {
                "name": "Sling",
                "type": "weapon",
                "weight": {
                    "lb": 0
                },
                "cost": {
                    "sp": 1
                },
                "description": "Proficiency with a Sling allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
                "equipped": true,
                "params": {
                    "weapontype": "simple",
                    "attacktype": "ranged",
                    "distance": {
                        "reach": 0,
                        "range": 30,
                        "maxrange": 120
                    },
                    "damage": {
                        "type": "bludgeoning",
                        "dice": {
                            "d4": 1
                        }
                    },
                    "ammunition": {
                        "total": 20,
                        "current": 20
                    }
                }
            },
            {
                "name": "Ergonite staff",
                "type": "weapon",
                "weight": 4,
                "cost": null,
                "description": "The crystal at the end of this staff glows when ergonite is close. Its brightness is proportional to the potency and proximity of the ergonite. As an action, repair up to 1sqft of ergonite, joining fragments into a single naturalistic lump and removing any engravings.",
                "equipped": true,
                "params": {
                    "weapontype": "quarterstaff",
                    "attacktype": "melee",
                    "distance": {
                        "reach": 5,
                        "range": 0,
                        "maxrange": 0
                    },
                    "damage": {
                        "type": "bludgeoning",
                        "dice": {
                            "d6": 1
                        }
                    }
                }
            },
            {
                "name": "Volatile pebbles",
                "type": "consumable",
                "weight": null,
                "cost": "180g",
                "description": "Single use, augments Magic Stone to deal 2d6 fire damage in 10ft radius (in addition to normal damage)",
                "equipped": true,
                "params": {
                    "quantity": 9,
                    "time": {
                        "type": "bonusaction",
                        "amount": 1
                    }
                }
            },
            {
                "name": "Incriminating Letters",
                "type": "misc",
                "weight": null,
                "cost": null,
                "description": "Sales receipts for ergonite, mentions of a mining group, Duke was involved",
                "equipped": false
            }
        ]
    }
}